# 序列名[开始位置的下标:结束位置的下标:步长]

str1 = '012345678'

# 输出整个字符串
print(str1)

# 输出单个字符
print(str1[0])  # 下标从 0 开始

# 输出切片
print(str1[2:5:1])      # 234-[2,5)     不包含结束符
print(str1[2:5:2])      # 24


print(str1[2:5])        # 234           默认步长为 1
print(str1[:5])         # 01234         从 0 开始
print(str1[2:])         # 2345678       到结束
print(str1[:])          # 012345678     从头到尾


# 负数测试
print(str1[:-1])        # 01234567      -1 表示倒数第一个字符
print(str1[-4:-1])      # 567
print(str1[-4:-1:-1])   # 空            “选取方向(5 -> 8)”与“步长方向(右 -> 左)”冲突，无法截取数据
print(str1[0:9:-1])     # 空            “选取方向(0 -> 9)”与“步长方向(右 -> 左)”冲突，无法截取数据


# 倒序
print(str1[::-1])       # 876543210     整体倒序
print(str1[-1:-4:-1])   # 876           部分倒序
print(str1[8:5:-1])     # 876


# 序号:   -9  -8  -7  -6  -5  -4  -3  -2  -1
# 字符串:  0   1   2   3   4   5   6   7   8
