def f1(a, b, c=0, *args, **kw):
    print('a =', a, 'b =', b, 'c =', c, 'args =', args, 'kw =', kw)


def f2(a, b, c=0, *, d, **kw):
    print('a =', a, 'b =', b, 'c =', c, 'd =', d, 'kw =', kw)


# 1.参数定义的顺序必须是：必选参数、默认参数、可变参数、命名关键字参数和关键字参数。
f1(1, 2)
f1(1, 2, 3, 'a')
f1(1, 2, 3, x=99)
f1(1, 2, 3, 'a', 'b', x=99)
f2(1, 2, d=99, ext=None)

# 2.对于任意函数，都可以通过类似func(*args, **kw)的形式调用它，无论它的参数是如何定义的
args1 = (1, 2, 3, 4)
kw1 = {'d': 99, 'x': '#'}
f1(*args1, **kw1)

args2 = (1, 2, 3)
kw2 = {'d': 88, 'x': '#'}
f2(*args2, **kw2)
