"""
numpy.dot(a, b, out=None)
1.a、b是两个一维数组，计算的是：向量的点积，结果是一个数字
2.a、b是两个多维数组，计算的是：矩阵的乘法，结果仍是一个矩阵
3.a、b是一个是数组，一个是数字，计算的是：矩阵中的每个元素分别乘以该数字
"""

import numpy as np

# 一维数组
a = np.array([1, 2])
b = np.array([3, 4])
print(np.dot(a, b))  # a[0]*b[0] + a[1]*b[1]


# 二维数组
a = np.array([[1, 2],
              [3, 4]])

b = np.array([[11, 12],
              [13, 14]])

# [[a[0,0]*b[0,0] + a[0,1]*b[1,0], a[0,0]*b[0,1] + a[0,1]*b[1,1]],
#  [a[1,0]*b[0,0] + a[1,1]*b[1,0], a[1,0]*b[0,1] + a[1,1]*b[1,1]]]
print(np.dot(a, b))


# 三维数组
a = np.array([[1, 2, 3],
              [4, 5, 6],
              [7, 8, 9]])

b = np.array([[11, 12, 13],
              [14, 15, 16],
              [17, 18, 19]])

print(np.dot(a, b))
