"""
numpy.vdot(a, b) - 计算两个向量的点积（对应元素相乘，再求和）
"""

import numpy as np

# 一维数组
a = np.array([1, 2])
b = np.array([3, 4])
print(np.vdot(a, b))  # a[0]*b[0] + a[1]*b[1]


# 二维数组
a = np.array([[1, 2],
              [3, 4]])

b = np.array([[11, 12],
              [13, 14]])

"""
print(a[0,0]*b[0,0] + a[0,1]*b[0,1] +
      a[1,0]*b[1,0] + a[1,1]*b[1,1] )
"""
print(np.vdot(a, b))


# 三维数组
a = np.array([[1, 2, 3],
              [4, 5, 6],
              [7, 8, 9]])

b = np.array([[11, 12, 13],
              [14, 15, 16],
              [17, 18, 19]])

"""
print(a[0,0]*b[0,0] + a[0,1]*b[0,1] + a[0,2]*b[0,2] +
      a[1,0]*b[1,0] + a[1,1]*b[1,1] + a[1,2]*b[1,2] +
      a[2,0]*b[2,0] + a[2,1]*b[2,1] + a[2,2]*b[2,2] )
"""
print(np.vdot(a, b))
